buzzwang1/pcb/source/Driver/STM32/U5/HAL/cI2C/v01.00.07/cI2C.h
#ifndef __cI2C_H__
#define __cI2C_H__

#include "Typedef.h"
#include "stm32u5xx.h"
#include "stm32u5xx_hal.h"
#include "stm32u5xx_hal_i2c.h"
#include "stm32u5xx_ll_i2c.h"
#include "stm32u5xx_ll_dma.h"

#include "tGPPin.h"
#include "ComDat.h"
#include "ClockInfo.h"

class cComNodeI2c_Slave : public cComNode
{
public:
  cComDatMsg mpcMsg;

  cComNodeI2c_Slave(uint32 lui32TxDataSize, uint32 lui32RxDataSize)
  {
    mpcMsg.vMemAlloc(lui32TxDataSize, lui32RxDataSize);
  };

  //~cComNodeI2c_Slave() {};

  inline uint32 SizeOf()
  {
    return mpcMsg.SizeOf() -
           sizeof(mpcMsg) +
           sizeof(cComNodeI2c_Slave);
  }
};


class cI2cMaster_ComNodeList :public cComNodeList
{
  public:
    cI2cMaster_ComNodeList(uint32 lui32SlavesCnt)
      :cComNodeList(lui32SlavesCnt)
      {}

  inline uint32 SizeOf()
  {
    return cComNodeList::SizeOf() +
           sizeof(cI2cMaster_ComNodeList);
  }
};

class cI2c
{
  public:

  cComNode::tenState mSm;
  tenComDeviceStatus munDeviceStatus;
  tenComBusStatus    munBusStatus;
  tenComStatus       munComStatus;

  u16                  mu16TickCounter;
  cGpPin *mPinSCL;
  cGpPin *mPinSDA;

  I2C_TypeDef   *mI2C;

  uint8 mui8Adr1;
  uint8 mui8Adr2;

  u8    mu8ChannelTx;
  u8    mu8ChannelRx;
  DMA_Channel_TypeDef* mstChannelRx;
  DMA_Channel_TypeDef* mstChannelTx;

  bool mbMaster;
  cComNode::tenConsts menOption;

  cI2c(I2C_TypeDef *lstI2c, cGpPin *lcScl, cGpPin *lcSda, bool lbMaster, u8 lu8ChannelRx = 3, u8 lu8ChannelTx = 4)
  {
    mI2C = lstI2c;

    mPinSCL = lcScl;
    mPinSDA = lcSda;

    munDeviceStatus = tenComDeviceStatus::enDeviceNotInit;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;

    mbMaster        = lbMaster;
    menOption       = cComNode::tenConsts::enNop;

    mu8ChannelRx = lu8ChannelRx;
    mu8ChannelTx = lu8ChannelTx;

    mstChannelRx = ((DMA_Channel_TypeDef*)(GPDMA1_BASE + LL_DMA_CH_OFFSET_TAB[lu8ChannelRx]));
    mstChannelTx = ((DMA_Channel_TypeDef*)(GPDMA1_BASE + LL_DMA_CH_OFFSET_TAB[lu8ChannelTx]));
  }

  void  vSetAdr2(u8 lui8Adr2)
  {
    LL_I2C_DisableOwnAddress2(mI2C);
    if (lui8Adr2)
    {
      mui8Adr2 = lui8Adr2;
      LL_I2C_SetOwnAddress2(mI2C, mui8Adr2, 0);
      LL_I2C_EnableOwnAddress2(mI2C);
    }
  }

  inline void vStopDMA()
  {
    mstChannelRx->CCR &= ~DMA_CCR_EN;
    mstChannelTx->CCR &= ~DMA_CCR_EN;
  }

  // Überpruft ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas empfangen wurde
  u16 u16GetDmaCounter()
  {
    return (mstChannelRx->CBR1 & 0xFFFF);
  }

  void vStartDMATx(uint8* pBuffer, uint32 BufferSize)
  {
    mstChannelTx->CFCR   = DMA_CFCR_TCF;
    mstChannelTx->CCR   &= ~DMA_CCR_EN;
    mstChannelTx->CBR1   = BufferSize;
    mstChannelTx->CSAR   = (uint32)pBuffer;
    mstChannelTx->CCR   |= DMA_CCR_EN;
  }

  void vStartDMARx(uint8* pBuffer, uint32 BufferSize)
  {
    mstChannelRx->CFCR   = DMA_CFCR_TCF;
    mstChannelRx->CCR   &= ~DMA_CCR_EN;
    mstChannelRx->CBR1   = BufferSize;
    mstChannelRx->CDAR   = (uint32)pBuffer;
    mstChannelRx->CCR   |= DMA_CCR_EN;
  }

  void  vClearClockLine()
  {
    mPinSCL->vSetMode(GPIO_MODE_OUTPUT_OD);
    //mPinSCL->vSetMode(GPIO_MODE_OUTPUT_OD);


    for (u8 lu8t = 0; lu8t < 9; lu8t++)
    {
      cClockInfo::Delay_us(4);
      mPinSCL->vSet0();
      cClockInfo::Delay_us(4);
      mPinSCL->vSet1();
    }

    if (mI2C == I2C1) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);}
    if (mI2C == I2C2) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C2);}
    if (mI2C == I2C3) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C3);}
    if (mI2C == I2C4) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C4);}
  }


  void vInitDma()
  {
    /* Enable DMA clock */
    __HAL_RCC_GPDMA1_CLK_ENABLE();

    /* DMA node configuration declaration */
    LL_DMA_InitTypeDef           lstDmaInit;

    LL_DMA_StructInit(&lstDmaInit);

    lstDmaInit.BlkHWRequest  = LL_DMA_HWREQUEST_SINGLEBURST;
    lstDmaInit.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;

    lstDmaInit.SrcBurstLength  = 1;
    lstDmaInit.DestBurstLength = 1;

    lstDmaInit.SrcDataWidth  = LL_DMA_SRC_DATAWIDTH_BYTE;
    lstDmaInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;


    lstDmaInit.Priority = LL_DMA_LOW_PRIORITY_LOW_WEIGHT;
    lstDmaInit.BlkDataLength = 0;

    lstDmaInit.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;

    ////If the destination data size is shorter than a word, this bit is ignored
    //lstDmaInit.DestHWordExchange = LL_DMA_DEST_HALFWORD_PRESERVE;
    //lstDmaInit.DestByteExchange  = LL_DMA_DEST_BYTE_PRESERVE;
    ////If the source data width is shorter than a word, this bit is ignored.
    //lstDmaInit.SrcByteExchange   = LL_DMA_SRC_BYTE_PRESERVE;


    // Not needed
    //lstDmaInit.LinkStepMode        = LL_DMA_LSM_FULL_EXECUTION;
    //lstDmaInit.LinkedListBaseAddr  = 0;
    //lstDmaInit.LinkedListAddrOffset = 0;
    //lstDmaInit.LinkAllocatedPort = LL_DMA_LINK_ALLOCATED_PORT1;

    //lstDmaInit.TriggerMode      = LL_DMA_TRIGM_BLK_TRANSFER;
    //lstDmaInit.TriggerPolarity  = LL_DMA_TRIG_POLARITY_RISING;
    //lstDmaInit.TriggerSelection = 0;


    // Programming this field is mandatory only for 2D addressing channels.
    /*lstDmaInit.BlkRptCount;
    lstDmaInit.SrcAddrUpdateMode;
    lstDmaInit.DestAddrUpdateMode;
    lstDmaInit.SrcAddrOffset;
    lstDmaInit.DestAddrOffset;
    lstDmaInit.BlkRptSrcAddrUpdateMode;
    lstDmaInit.BlkRptDestAddrUpdateMode;
    lstDmaInit.BlkRptSrcAddrOffset;
    lstDmaInit.BlkRptDestAddrOffset;*/


    // -Port 0 should be allocated for transfers toand from
    //  peripherals, because there is a direct hardware datapath
    //  between this portand the APB peripherals, outside the  AHB matrix
    // -Port 1 should be allocated for transfers toand from
    //  memory, which are performed through the AHB interconnect.

    if (mI2C == I2C1) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C1_RX;
    if (mI2C == I2C2) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C2_RX;
    if (mI2C == I2C3) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C3_RX;
    if (mI2C == I2C4) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C4_RX;
    lstDmaInit.SrcAddress  = LL_I2C_DMA_GetRegAddr(mI2C, LL_I2C_DMA_REG_DATA_RECEIVE);
    lstDmaInit.DestAddress = 0;
    lstDmaInit.SrcIncMode  = LL_DMA_SRC_FIXED;
    lstDmaInit.DestIncMode = LL_DMA_DEST_INCREMENT;
    lstDmaInit.Direction   = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
    lstDmaInit.SrcAllocatedPort  = LL_DMA_DEST_ALLOCATED_PORT0; // Source is periph
    lstDmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT1; // Dest is memory
    LL_DMA_Init(GPDMA1, mu8ChannelRx, &lstDmaInit);

