buzzwang1/pcb/source/Driver/STM32/U5/HAL/cI2C/v01.00.07/cI2C.h
    if (mI2C == I2C1) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C1_TX;
    if (mI2C == I2C2) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C2_TX;
    if (mI2C == I2C3) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C3_TX;
    if (mI2C == I2C4) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C4_TX;
    lstDmaInit.SrcAddress  = 0;
    lstDmaInit.DestAddress = LL_I2C_DMA_GetRegAddr(mI2C, LL_I2C_DMA_REG_DATA_TRANSMIT);
    lstDmaInit.SrcIncMode  = LL_DMA_SRC_INCREMENT;
    lstDmaInit.DestIncMode = LL_DMA_DEST_FIXED;
    lstDmaInit.Direction   = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    lstDmaInit.SrcAllocatedPort  = LL_DMA_DEST_ALLOCATED_PORT1; // Source is memory
    lstDmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT0; // Dest is periph
    LL_DMA_Init(GPDMA1, mu8ChannelTx, &lstDmaInit);
  }

  void  vInitHw() // __attribute__((optimize("-O0")))
  {
    I2C_HandleTypeDef lhI2c = {};

    if (mI2C == I2C1) __HAL_RCC_I2C1_CLK_DISABLE();
    if (mI2C == I2C2) __HAL_RCC_I2C2_CLK_DISABLE();
    if (mI2C == I2C3) __HAL_RCC_I2C3_CLK_DISABLE();
    if (mI2C == I2C4) __HAL_RCC_I2C4_CLK_DISABLE();

    vStopDMA();

    //SDA and SCL must be pulled high
    if (mbMaster)
    {
      if (!bCheckPins()) vClearClockLine();
      if (!bCheckPins()) return;
    }


    if (mI2C == I2C1) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);
                        mPinSDA->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);}
    if (mI2C == I2C2) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C2);
                        mPinSDA->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C2);}
    if (mI2C == I2C3) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C3);
                        mPinSDA->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C3);}
    if (mI2C == I2C4) { mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C4);
                        mPinSDA->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C4);}

    /* I2C Periph clock enable */
    if (mI2C == I2C1) __HAL_RCC_I2C1_CLK_ENABLE();
    if (mI2C == I2C2) __HAL_RCC_I2C2_CLK_ENABLE();
    if (mI2C == I2C3) __HAL_RCC_I2C3_CLK_ENABLE();
    if (mI2C == I2C4) __HAL_RCC_I2C4_CLK_ENABLE();

    /* I2C Peripheral Disable */
    LL_I2C_Disable(mI2C);

    /* Configure the I2C clock source. The clock is derived from the HSI */
    //RCC_I2CCLKConfig(RCC_I2C2CLK_HSI);

    /* I2C configuration */
    /* I2C configuration */      // 16Mhz => 400khz = 2.5us => 40 Ticks => (15H + 25L)
    lhI2c.Instance = mI2C;       //PRESC(4Bit) + Reserced(4Bit) + SCLDEL(4Bit) + SDADEL(4Bit) + SCLH(8Bit)      + SCLL(8Bit)
    //lhI2c.Init.Timing          = 0x0010061A;
    //lhI2c.Init.Timing          = 0x00100C0D;
    lhI2c.Init.Timing          = (0x1 << 28)   +  (0x1 << 24)   + (0x4 << 20)  + (0x4 << 16)  + ((4) << 8)      + (7);
    lhI2c.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLED;
    lhI2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    lhI2c.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    lhI2c.Init.OwnAddress1     = mui8Adr1;
    lhI2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    lhI2c.Init.OwnAddress2     = mui8Adr2;
    lhI2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    lhI2c.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;

    /* 8Mhz (HSI  */
    /*
      100khz  = 0x10420F13  PRESC = 1; SCLL = 0x13; SCLH = 0xF; SDADEL = 0x2; SCLDEL = 0x4 => 100khz
      400khz  = 0x00310309  PRESC = 0; SCLL = 0x09; SCLH = 0x3; SDADEL = 0x1; SCLDEL = 0x3 => 364Khz
      500khz  = 0x00100308  PRESC = 0; SCLL = 0x06; SCLH = 0x3; SDADEL = 0x0; SCLDEL = 0x1 => 384khz
      1000khz = 0x00100103  PRESC = 0; SCLL = 0x03; SCLH = 0x1; SDADEL = 0x0; SCLDEL = 0x1 => 555khz
    */

    /* Peripheral clock enable */
    HAL_I2C_Init(&lhI2c);
    HAL_I2CEx_AnalogFilter_Config(&lhI2c, I2C_ANALOGFILTER_ENABLED);
    if (!mbMaster)
    {
      vSetAdr2(mui8Adr2);
    }

    mI2C->ICR = 0xFFFF;

    /* I2C Peripheral Enable */
    LL_I2C_Enable(mI2C);

    LL_I2C_EnableDMAReq_RX(mI2C);
    LL_I2C_EnableDMAReq_TX(mI2C);

    if (isErrorActive())
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
      return;
    }

    if (mI2C->ISR & I2C_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      return;
    }

    IRQn_Type lnNVIC_IRQChannel;

    if (mI2C == I2C1) lnNVIC_IRQChannel = I2C1_EV_IRQn; //I2C1 connect to channel 7 of DMA1
    if (mI2C == I2C2) lnNVIC_IRQChannel = I2C2_EV_IRQn;
    /* Set the TIMx priority */
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 8, 8);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);


    if (mI2C == I2C1) lnNVIC_IRQChannel = I2C1_ER_IRQn; //I2C1 connect to channel 7 of DMA1
    if (mI2C == I2C2) lnNVIC_IRQChannel = I2C2_ER_IRQn;
    /* Set the TIMx priority */
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 8, 8);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);


    if (mbMaster)
    {
      mI2C->CR1 |= I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE;
    }
    else
    {
      mI2C->CR1 |= I2C_CR1_ERRIE | I2C_CR1_STOPIE | I2C_CR1_ADDRIE;
    }

    vInitDma();

    munDeviceStatus = tenComDeviceStatus::enDeviceReady;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;
    mSm             = cComNode::tenState::enStIdle;
  }

  void  vReInitHw(cComNode::tenConsts lenOption)
  {
    menOption = lenOption;
  }

  void vTick10ms()
  {
    cComNode::tenConsts lenOption;
    lenOption = menOption;
    menOption = cComNode::tenConsts::enNop;
    if (lenOption != cComNode::tenConsts::enNop)
    {
      if (lenOption == cComNode::enResetHwFull)
      {
        vInitHw();
      }
      else
      {
        // I2C Peripheral Disnable
        LL_I2C_Disable(mI2C);
        vStopDMA();

        if (mbMaster)
        {
          //SDA and SCL must be pulled high
          if (!bCheckPins()) return;

          mPinSDA->vSetMode(GPIO_MODE_AF_OD);
          mPinSCL->vSetMode(GPIO_MODE_AF_OD);
        }

        mI2C->ICR = 0xFFFF;

        // I2C Peripheral Enable
        LL_I2C_Enable(mI2C);

        munDeviceStatus = tenComDeviceStatus::enDeviceReady;
        munBusStatus    = tenComBusStatus::enBusNoError;
        munComStatus    = tenComStatus::enStatusIdle;
        mSm             = cComNode::tenState::enStIdle;
      }

      if (isErrorActive())
      {
        munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
        munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
        return;
      }

      if (mI2C->ISR & I2C_ISR_BUSY)
      {
        munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
        munBusStatus    = tenComBusStatus::enBusNotReady;
        return;
      }
    }
  }

  bool bCheckBus()
    {
    if (mI2C->ISR & I2C_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      mSm = cComNode::enStError;
      return False;
    }
    return True;
  }

  bool bCheckPins()
  {
    mPinSCL->vSetMode(GPIO_MODE_INPUT);
    mPinSDA->vSetMode(GPIO_MODE_INPUT);

    //SDA and SCL must be pulled high
    if ((mPinSCL->ui8Get() == 0) || (mPinSDA->ui8Get() == 0))
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorPins;
      mSm             = cComNode::enStError;
      return False;
    }
    return True;
  }

  uint8 isErrorActive()
  {
    uint32 lui32ErrorMask;

